// Работа с переменными
// Объявите две переменные: admin и name.
// Запишите строку "Джон" в переменную name.
// Скопируйте значение из переменной name в admin.
// Выведите на экран значение admin, используя функцию alert (должна показать «Джон»).

let admin, name;
name = "Джон";
admin = name;
alert(admin);

// Придумайте правильные имена
// Создайте переменную для названия нашей планеты. Как бы вы её назвали?
// Создайте переменную для хранения имени текущего посетителя сайта. Как бы вы назвали такую переменную?

let ourPlanetName = "Земля";
let currentUserName = "Джон";

// Какие буквы (заглавные или строчные) использовать для имён констант?

BIRTHDAY // известно до начала исполнения скрипта
age // неизвестно до загрузки страницы